app/controllers/api/v1/activities_controller.rb

  def index
    @activities = Activity.all
---
SELECT  "activities".* FROM "activities" WHERE (Donate blood at a local blood center) LIMIT $1  [["LIMIT", 1]]

  def find_or_create_activity
    # byebug
    if Activity.find_by(activity: params[:activity])
      @activity = Activity.find_by(activity: params[:activity])
      render json: @activity
    else
      @activity = Activity.new(activity_params)
      if @activity.save
---
SELECT  "activities".* FROM "activities" WHERE "activities"."activity" = $1 LIMIT $2  [["activity", "Pick up litter around your favorite park"], ["LIMIT", 1]]
INSERT INTO "activities" ("activity", "category", "link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"