app/controllers/api/v1/auth_controller.rb

  def create
    user = User.find_by(username: login_user_params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "NotCool"], ["LIMIT", 1]]