app/controllers/api/v1/journals_controller.rb

SELECT "journals".* FROM "journals"
---
  def index
    @journalEntries = Journal.all

INSERT INTO "journals" ("date", "participants", "learned", "favorite_part", "least_favorite", "created_at", "updated_at", "user_id", "activity_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @journal = Journal.new(journal_params)
    if @journal.save