app/controllers/api/v1/user_activities_controller.rb

  def index
    @relationships = UserActivity.all
---
SELECT "user_activities".* FROM "user_activities" WHERE "user_activities"."user_id" = $1  [["user_id", 7]]

  def create
    @relationship = UserActivity.create(relationship_params)
---
INSERT INTO "user_activities" ("user_id", "activity_id", "tried", "created_at", "updated_at", "journaled") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 7], ["activity_id", 54], ["tried", nil], ["created_at", "2019-01-02 15:36:41.553218"], ["updated_at", "2019-01-02 15:36:41.553218"], ["journaled", nil]]

  def show
    @relationship = UserActivity.find(params[:id])
---
SELECT  "user_activities".* FROM "user_activities" WHERE "user_activities"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]

  def update
    # byebug
    @relationship = UserActivity.find(params[:id])
      @relationship.update(tried: params[:body][:tried], journaled: params[:body][:journaled])
---
SELECT  "user_activities".* FROM "user_activities" WHERE "user_activities"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
UPDATE "user_activities" SET "tried" = $1, "journaled" = $2, "updated_at" = $3 WHERE "user_activities"."id" = $4  [["tried", true], ["journaled", false], ["updated_at", "2019-01-02 15:39:57.909447"], ["id", 103]]

  def destroy
    # byebug
    @relationship = UserActivity.find(params[:id])
    @relationship.destroy
---
SELECT  "user_activities".* FROM "user_activities" WHERE "user_activities"."id" = $1 LIMIT $2  [["id", 48], ["LIMIT", 1]]
DELETE FROM "user_activities" WHERE "user_activities"."id" = $1  [["id", 48]]